app/controllers/api/v1/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons" WHERE (name ILIKE '%pik%')
---
  def index
    render json: Pokemon.all